podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_S32K148.svd.xml
<!--
Devices using this peripheral: 
      S32K148
-->
      <peripheral>
         <?sourceFile "SIM_S32K148" ?>
         <name>SIM</name>
         <description>System Integration Module</description>
         <groupName>SIM</groupName>
         <headerStructName>SIM</headerStructName>
         <baseAddress>0x40048000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x4</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xC</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x18</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x40</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x4C</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x54</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x68</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CHIPCTL</name>
               <description>Chip Control register</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0x300000</resetValue>
               <fields>
                  <field>
                     <name>ADC_INTERLEAVE_EN</name>
                     <description>ADC interleave channel enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>Interleaving disabled. No channel pair interleaved. Interleaved channels are individually connected to pins. PTC0 is connected to ADC0_SE8. PTC1 is connected to ADC0_SE9. PTB15 is connected to ADC1_SE14. PTB16 is connected to ADC1_SE15. PTB0 is connected to ADC0_SE4. PTB1 is connected to ADC0_SE5. PTB13 is connected to ADC1_SE8. PTB14 is connected to ADC1_SE9</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1xxx</name>
                           <description>PTB14 to ADC1_SE9 and ADC0_SE9</description>
                           <value>0b1xxx</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>x1xx</name>
                           <description>PTB13 to ADC1_SE8 and ADC0_SE8</description>
                           <value>0bx1xx</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>xx1x</name>
                           <description>PTB1 to ADC0_SE5 and ADC1_SE15</description>
                           <value>0bxx1x</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>xxx1</name>
                           <description>PTB0 to ADC0_SE4 and ADC1_SE14</description>
                           <value>0bxxx1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKOUTSEL</name>
                     <description>CLKOUT Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0000</name>
                           <description>SCG CLKOUT</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>SOSC DIV2 CLK</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>SIRC DIV2 CLK</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>For S32K148: QSPI SFIF_CLK_HYP: Divide by 2 clock (configured through SCLKCONFIG[5]) for HyperRAM going to sfif clock to QSPI; For others: Reserved</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>FIRC DIV2 CLK</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>HCLK</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>SPLL DIV2 CLK</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>BUS_CLK</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1010</name>
                           <description>LPO128K_CLK</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>For S32K148: QSPI IPG_CLK; For others: Reserved</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1100</name>
                           <description>LPO_CLK as selected by SIM_LPOCLKS[LPOCLKSEL]</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1101</name>
                           <description>For S32K148: QSPI IPG_CLK_SFIF; For others: Reserved</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1110</name>
                           <description>RTC_CLK as selected by SIM_LPOCLKS[RTCCLKSEL]</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1111</name>
                           <description>For S32K148: QSPI IPG_CLK_2XSFIF; For others: Reserved</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKOUTDIV</name>
                     <description>CLKOUT Divide Ratio</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>Divide by 1</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>Divide by 2</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Divide by 3</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Divide by 4</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>Divide by 5</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>Divide by 6</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>Divide by 7</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>Divide by 8</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKOUTEN</name>
                     <description>CLKOUT enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clockout disable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clockout enable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRACECLK_SEL</name>
                     <description>Debug trace clock select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Core clock</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Platform clock</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PDB_BB_SEL</name>
                     <description>PDB back-to-back select</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PDB0 channel 0 back-to-back operation with ADC0 COCO[7:0] and PDB1 channel 0 back-to-back operation with ADC1 COCO[7:0]</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel 0 of PDB0 and PDB1 back-to-back operation with COCO[7:0] of ADC0 and ADC1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC_SUPPLY</name>
                     <description>ADC_SUPPLY</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>5 V input VDD supply (VDD)</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>5 V input analog supply (VDDA)</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>ADC Reference Supply (VREFH)</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>3.3 V Oscillator Regulator Output (VDD_3V)</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>3.3 V flash regulator output (VDD_flash_3V)</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>1.2 V core regulator output (VDD_LV)</description>
                           <value>0b101</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC_SUPPLYEN</name>
                     <description>ADC_SUPPLYEN</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable internal supply monitoring</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable internal supply monitoring</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRAMU_RETEN</name>
                     <description>SRAMU_RETEN</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>SRAMU contents are retained across resets</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>No SRAMU retention</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRAML_RETEN</name>
                     <description>SRAML_RETEN</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>SRAML contents are retained across resets</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>No SRAML retention</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
