podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_S32K148.svd.xml
            <register>
               <name>FTMOPT0</name>
               <description>FTM Option Register 0</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>FTM0FLTxSEL</name>
                     <description>FTM0 Fault X Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>FTM0_FLTx pin</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>TRGMUX_FTM0 out</description>
                           <value>0b001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM1FLTxSEL</name>
                     <description>FTM1 Fault X Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>FTM1_FLTx pin</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>TRGMUX_FTM1 out</description>
                           <value>0b001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM2FLTxSEL</name>
                     <description>FTM2 Fault X Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>FTM2_FLTx pin</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>TRGMUX_FTM2 out</description>
                           <value>0b001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM3FLTxSEL</name>
                     <description>FTM3 Fault X Select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>FTM3_FLTx pin</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>TRGMUX_FTM3 out</description>
                           <value>0b001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM4CLKSEL</name>
                     <description>FTM4 External Clock Pin Select</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>FTM4 external clock driven by TCLK0 pin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>FTM4 external clock driven by TCLK1 pin</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>FTM4 external clock driven by TCLK2 pin</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>No clock input</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM5CLKSEL</name>
                     <description>FTM5 External Clock Pin Select</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>FTM5 external clock driven by TCLK0 pin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>FTM5 external clock driven by TCLK1 pin</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>FTM5 external clock driven by TCLK2 pin</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>No clock input</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM6CLKSEL</name>
                     <description>FTM6 External Clock Pin Select</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>FTM6 external clock driven by TCLK0 pin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>FTM6 external clock driven by TCLK1 pin</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>FTM6 external clock driven by TCLK2 pin</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>No clock input</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM7CLKSEL</name>
                     <description>FTM7 External Clock Pin Select</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>FTM7 external clock driven by TCLK0 pin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>FTM7 external clock driven by TCLK1 pin</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>FTM7 external clock driven by TCLK2 pin</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>No clock input</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0CLKSEL</name>
                     <description>FTM0 External Clock Pin Select</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>FTM0 external clock driven by TCLK0 pin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>FTM0 external clock driven by TCLK1 pin</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>FTM0 external clock driven by TCLK2 pin</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>No clock input</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM1CLKSEL</name>
                     <description>FTM1 External Clock Pin Select</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>FTM1 external clock driven by TCLK0 pin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>FTM1 external clock driven by TCLK1 pin</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>FTM1 external clock driven by TCLK2 pin</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>No clock input</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM2CLKSEL</name>
                     <description>FTM2 External Clock Pin Select</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>FTM2 external clock driven by TCLK0 pin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>FTM2 external clock driven by TCLK1 pin</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>FTM2 external clock driven by TCLK2 pin</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>No clock input</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM3CLKSEL</name>
                     <description>FTM3 External Clock Pin Select</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>FTM3 external clock driven by TCLK0 pin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>FTM3 external clock driven by TCLK1 pin</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>FTM3 external clock driven by TCLK2 pin</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>No clock input</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LPOCLKS</name>
               <description>LPO Clock Select Register</description>
               <addressOffset>0x10</addressOffset>
               <resetValue>0x3</resetValue>
               <fields>
                  <field>
                     <name>LPO1KCLKEN</name>
                     <description>1 kHz LPO_CLK enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable 1 kHz LPO_CLK output</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable 1 kHz LPO_CLK output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPO32KCLKEN</name>
                     <description>32 kHz LPO_CLK enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable 32 kHz LPO_CLK output</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Enable 32 kHz LPO_CLK output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPOCLKSEL</name>
                     <description>LPO clock source select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>128 kHz LPO_CLK</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>No clock</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>32 kHz LPO_CLK which is derived from the 128 kHz LPO_CLK</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>1 kHz LPO_CLK which is derived from the 128 kHz LPO_CLK</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RTCCLKSEL</name>
                     <description>32 kHz clock source select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>SOSCDIV1_CLK</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>32 kHz LPO_CLK</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>RTC_CLKIN clock</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>FIRCDIV1_CLK</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
