podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_S32K148.svd.xml
            <register>
               <name>ADCOPT</name>
               <description>ADC Options Register</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>ADC0TRGSEL</name>
                     <description>ADC0 trigger source select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PDB output</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TRGMUX output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC0SWPRETRG</name>
                     <description>ADC0 software pretrigger sources</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>Software pretrigger disabled</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>Reserved (do not use)</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>Reserved (do not use)</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>Reserved (do not use)</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>Software pretrigger 0</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>Software pretrigger 1</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>Software pretrigger 2</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>Software pretrigger 3</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC0PRETRGSEL</name>
                     <description>ADC0 pretrigger source select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>PDB pretrigger (default)</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>TRGMUX pretrigger</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Software pretrigger</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ADC0TRGSEL" > <name>ADC1TRGSEL</name> <description>ADC1 trigger source select</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ADC0SWPRETRG" > <name>ADC1SWPRETRG</name> <description>ADC1 software pretrigger sources</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="ADC0PRETRGSEL" > <name>ADC1PRETRGSEL</name> <description>ADC1 pretrigger source select</description> <bitOffset>12</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>FTMOPT1</name>
               <description>FTM Option Register 1</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>FTM0SYNCBIT</name>
                     <description>FTM0 Sync Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FTM1SYNCBIT</name>
                     <description>FTM1 Sync Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FTM2SYNCBIT</name>
                     <description>FTM2 Sync Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FTM3SYNCBIT</name>
                     <description>FTM3 Sync Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FTM1CH0SEL</name>
                     <description>FTM1 CH0 Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>FTM1_CH0 input</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>CMP0 output</description>
                           <value>0b01</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM2CH0SEL</name>
                     <description>FTM2 CH0 Select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>FTM2_CH0 input</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>CMP0 output</description>
                           <value>0b01</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM2CH1SEL</name>
                     <description>FTM2 CH1 Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>FTM2_CH1 input</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>exclusive OR of FTM2_CH0,FTM2_CH1,and FTM1_CH1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM4SYNCBIT</name>
                     <description>FTM4 Sync Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FTM5SYNCBIT</name>
                     <description>FTM5 Sync Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FTM6SYNCBIT</name>
                     <description>FTM6 Sync Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FTM7SYNCBIT</name>
                     <description>FTM7 Sync Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FTMGLDOK</name>
                     <description>FTM global load enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>FTM Global load mechanism disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>FTM Global load mechanism enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0_OUTSEL</name>
                     <description>FTM0 channel modulation select with FTM1_CH1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00000000</name>
                           <description>No modulation with FTM1_CH1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00000001</name>
                           <description>Modulation with FTM1_CH1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM3_OUTSEL</name>
                     <description>FTM3 channel modulation select with FTM2_CH1</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00000000</name>
                           <description>No modulation with FTM2_CH1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>00000001</name>
                           <description>Modulation with FTM2_CH1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MISCTRL0</name>
               <description>Miscellaneous control register 0</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>FTM_GTB_SPLIT_EN</name>
                     <description>FTM GTB split enable/disable bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>All the FTMs have a single global time-base</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>FTM0-3 have a common time-base and others have a different common time-base. Please refer &apos;FTM global time base&apos; in FTM chapter for implementation details</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0_OBE_CTRL</name>
                     <description>FTM0 OBE CTRL bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The FTM channel output is put to safe state when the FTM counter is enabled and the FTM channel output is enabled by Fault Control (FTM_MODE[FAULTM]!=2&apos;b00 and FTM_FLTCTRL[FSTATE]=1&apos;b0) and PWM is enabled (FTM_SC[PWMENn] = 1&apos;b1). Otherwise the channel output is tristated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The FTM channel output state is retained when the channel is in output mode. The output channel is tristated when the channel is in input capture [DECAPEN=1&apos;b0, COMBINE=1&apos;b0, MSnB:MSnA=2&apos;b00] or dual edge capture mode [DECAPEN=1&apos;b1]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FTM0_OBE_CTRL" > <name>FTM1_OBE_CTRL</name> <description>FTM1 OBE CTRL bit</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="FTM0_OBE_CTRL" > <name>FTM2_OBE_CTRL</name> <description>FTM2 OBE CTRL bit</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="FTM0_OBE_CTRL" > <name>FTM3_OBE_CTRL</name> <description>FTM3 OBE CTRL bit</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="FTM0_OBE_CTRL" > <name>FTM4_OBE_CTRL</name> <description>FTM4 OBE CTRL bit</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="FTM0_OBE_CTRL" > <name>FTM5_OBE_CTRL</name> <description>FTM5 OBE CTRL bit</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="FTM0_OBE_CTRL" > <name>FTM6_OBE_CTRL</name> <description>FTM6 OBE CTRL bit</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="FTM0_OBE_CTRL" > <name>FTM7_OBE_CTRL</name> <description>FTM7 OBE CTRL bit</description> <bitOffset>23</bitOffset> </field>
                  <field>
                     <name>RMII_CLK_OBE</name>
                     <description>RMII CLK OBE bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RMII_CLK_SEL</name>
                     <description>RMII CLK Select bit</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>FIRCDIV1_CLK</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SOSCDIV1_CLK</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QSPI_CLK_SEL</name>
                     <description>QSPI CLK Select bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>QuadSPI internal reference clock is gated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>QuadSPI internal reference clock is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SDID</name>
               <description>System Device Identification Register</description>
               <addressOffset>0x24</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>FEATURES</name>
                     <description>Features</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PACKAGE</name>
                     <description>Package</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>48 LQFP</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>64 LQFP</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>100 LQFP</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>144 LQFP</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>176 LQFP</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>100 MAP BGA</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REVID</name>
                     <description>Device revision number</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RAMSIZE</name>
                     <description>RAM size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>128 KB (S32K148), Reserved (others)</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>160 KB (S32K148) , Reserved (others)</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1011</name>
                           <description>192 KB (S32K148), 16 KB (S32K142), Reserved (others)</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1101</name>
                           <description>48 KB (S32K144), 24 KB (S32K142), Reserved (others)</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1111</name>
                           <description>256 KB (S32K148), 64 KB (S32K144), 32 KB (S32K142)</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DERIVATE</name>
                     <description>Derivate</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SUBSERIES</name>
                     <description>Subseries</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>GENERATION</name>
                     <description>S32K product series generation</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
