podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_S32K148.svd.xml
            <register>
               <name>PLATCGC</name>
               <description>Platform Clock Gating Control Register</description>
               <addressOffset>0x40</addressOffset>
               <resetValue>0x1F</resetValue>
               <fields>
                  <field>
                     <name>CGCMSCM</name>
                     <description>MSCM Clock Gating Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CGCMSCM" > <name>CGCMPU</name> <description>MPU Clock Gating Control</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="CGCMSCM" > <name>CGCDMA</name> <description>DMA Clock Gating Control</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="CGCMSCM" > <name>CGCERM</name> <description>ERM Clock Gating Control</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="CGCMSCM" > <name>CGCEIM</name> <description>EIM Clock Gating Control</description> <bitOffset>4</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>FCFG1</name>
               <description>Flash Configuration Register 1</description>
               <addressOffset>0x4C</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>DEPART</name>
                     <description>FlexNVM partition</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EEERAMSIZE</name>
                     <description>EEE SRAM SIZE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0010</name>
                           <description>4 KB</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0011</name>
                           <description>2 KB</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0100</name>
                           <description>1 KB</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0101</name>
                           <description>512 Bytes</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0110</name>
                           <description>256 Bytes</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0111</name>
                           <description>128 Bytes</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000</name>
                           <description>64 Bytes</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1001</name>
                           <description>32 Bytes</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1111</name>
                           <description>0 Bytes</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDH</name>
               <description>Unique Identification Register High</description>
               <addressOffset>0x54</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>UID127_96</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDMH</name>
               <description>Unique Identification Register Mid-High</description>
               <addressOffset>0x58</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>UID95_64</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDML</name>
               <description>Unique Identification Register Mid Low</description>
               <addressOffset>0x5C</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>UID63_32</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDL</name>
               <description>Unique Identification Register Low</description>
               <addressOffset>0x60</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>UID31_0</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKDIV4</name>
               <description>System Clock Divider Register 4</description>
               <addressOffset>0x68</addressOffset>
               <resetValue>0x10000000</resetValue>
               <fields>
                  <field>
                     <name>TRACEFRAC</name>
                     <description>Trace Clock Divider fraction To configure TRACEDIV and TRACEFRAC, you must first clear TRACEDIVEN to disable the trace clock divide function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRACEDIV</name>
                     <description>Trace Clock Divider value To configure TRACEDIV, you must first disable TRACEDIVEN, then enable it after setting TRACEDIV</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TRACEDIVEN</name>
                     <description>Debug Trace Divider control</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Debug trace divider disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Debug trace divider enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MISCTRL1</name>
               <description>Miscellaneous Control register 1</description>
               <addressOffset>0x6C</addressOffset>
               <fields>
                  <field>
                     <name>SW_TRG</name>
                     <description>Software trigger to TRGMUX. Writing to this bit generates software trigger to peripherals through TRGMUX (Refer to Figure: Trigger interconnectivity)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
